W9D5/music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
---
SELECT  "bands".* FROM "bands" ORDER BY "bands"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("title", "year", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Party"], ["year", 999], ["created_at", "2020-01-28 00:30:57.470916"], ["updated_at", "2020-01-28 00:30:57.470916"], ["band_id", 6]]