W9D1/first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 9], ["LIMIT", 1]]
---
  def index
    artwork = Artwork.find_by(artist_id: params[:user_id])

INSERT INTO "artworks" ("artist_id", "title", "img_url") VALUES ($1, $2, $3) RETURNING "id"  [["artist_id", 11], ["title", "apple"], ["img_url", "www.apple.com"]]
---
  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1 WHERE "artworks"."id" = $2  [["artist_id", 11], ["id", 7]]
---
  def update
    artwork = Artwork.find(params[:id])
    if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def favorite
    artwork = Artwork.find(params[:id])