W9D1/first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index
    artwork = Artwork.all