W9D1/first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

    def favorite
      # debugger
        artwork_share = ArtworkShare.find_by(id: params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]