W9D1/first_routes_and_controllers/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 2], ["LIMIT", 1]]
---
  def index
    user_comment = Comment.find_by(user_id: params[:user_id])
    artwork_comment = Comment.find_by(artwork_id: params[:artwork_id])