W9D1/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "sushil"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "John"]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "sushil"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    # found_user = User.find_by(username: user)
    # if found_user
    #   render json: found_user
    # else
    #   users = User.all
    #   render json: users
    # end
    user = params[:username]

    found_user = User.where('username LIKE ?', "%#{user}%")

    if !found_user.empty?
      render json: found_user
    else
      users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "jonathan"], ["updated_at", "2020-01-21 23:59:06.185514"], ["id", 10]]
---
  def update
    user = User.find(params[:id])
    if user_params[:username]
        user.update_attributes(user_params)